app/controllers/toys_controller.rb

  def index
    @toys = Toy.where(pet_id: params[:pet_id])
    if @toys.empty?
---
SELECT "toys".* FROM "toys" WHERE "toys"."pet_id" = $1  [["pet_id", 1]]
SELECT COUNT(*) FROM "toys" WHERE "toys"."pet_id" = $1  [["pet_id", 1]]

  def show
    @toy = Toy.find_by(pet_id: params[:pet_id], id: params[:id])
---
SELECT  "toys".* FROM "toys" WHERE "toys"."pet_id" = $1 AND "toys"."id" = $2 LIMIT $3  [["pet_id", 1], ["id", 4], ["LIMIT", 1]]